{
	"next_comment_id": 3,
	"comment": [
		{
			"comment_id": 1,
			"body": "Nagyon sokat fejlődött az egész ZeroNet rendszere.A rendszer legnagyobb gondja viszont fájlok,adatok átvitelében rejlik ami sokat fejlődött 2017 ben.Ha egyszer a html és a fájlok átvitele ki lesz dolgozva már az is egy hatalmas dolog lesz.\n\nA rendszert viszont lehetne stabilizálni egy protokollal hogy mindig minden elérhető legyen.Hasonló protokolt használ a safenet de tribler esetén is állítólag dolgoznak hasonlón.Úgy tudom a freenet is hasonló elven működik.A lényeg az lenne hogy a gépén mindenki biztosíthat egy extra tárhelyet.Ami tárhelyet biztosít abban az értékben tölthet fel adatot pluszban a hálózatra és kap extra tárhelyet a hálózatból.Ez úgy nézne ki szerver üzemeltető rész felől hogy amennyi extra tárhelyet biztosítok olyan értékben tölthetek fel extra adatot a protokoll alapján hasonló tárhelyre.Erre a tárhelyre autómatikusan töltödne fel az adat ha valaki feltölt valamit.A tárhely ürülhetne ha megtellik akkor a program újraindításakor törlődik.Ezt segítene ha bizonyos seed alatt vannak a felhasznállók a protokoll megakadályozná hogy a dolog leálljon.Valahogy így lehetne orvosolni ahol kevés a seed azok a fájlok is folyamatosan elérhetők legyenek.Ez a protokoll úgymond rásegítene a meglévő rendszerre sávszélben és a fájlok elérhetőségének fenntartásában.\n\nAmi még uttörő lenne és hiányzik az a PHP és MSQL támogatás hiánya.De amit eddig elért a program az egyszerűen már most is nagyszerű.A html oldalak beüzemelése az megy hasonló hálózatokon.De MSQL,PHP beüzemelésére nincsen hasonló P2P alapú alternatíva.Sem az I2p sem a Freeneten se másik platformokon.\n",
			"post_id": 122,
			"date_added": 1512647824
		},
		{
			"comment_id": 2,
			"body": "Video sharing  decentralised youtube and ZeroUp does not work correctly.The files and videos are dead in zeronet. When the user is offline the data will not avalible. There a new P2P protocoll what can fix this problem and make all files avalible in 24 houors non stop. If the first uploader (seeder) are offline and nobody downloaded the are no seeder,the file still will be avalible.\n\nThis protocoll for the ZeroNet developpers it might be useful.Its coled SAFE NETWORK.The problem larger files like ZeroUp,youtube on zeronet does not work correctly.Files and ZeroNet sites In many cases, they are not available.Simple the are no seed. Its would be great to integrate the protocoll a mechanism what all files and zites make 24 hour online for the users. \nMaidsafe program.\n\nHow is data stored and retrieved? \n\nFiles uploaded to the network are broken into pieces, encrypted and distributed across the network. This process is called Self-Encryption.When a user uploads (or saves) a ﬁle to the network, via one of the SAFE Network apps, the file is automatically broken up into chunks. These chunks are then encrypted (encoded so that only authorised parties can read it), randomised and stored on the computers of other SAFE Network users. These encrypted chunks are completely unreadable and inaccessible to anyone other than the owner.Once a ﬁle is uploaded, other users who upload the same ﬁle will be automatically referred to the original, limiting the number of copies and reducing the computing resources needed to store it.The network is programmed to keep duplicate copies of each piece of data at all times. As users turn their computers off, the network makes more copies and stores them on other machines, ensuring that users always have access to their files.This constant movement of data (called churn) is a key part of the security that the SAFE Network offers because there is no central point for hackers to target as the data locations keep changing.Example: A User uploads a 10 MB file. The file is split into 10 chunks (1 MB each) and made into 4 copies. This means there are 40 chunks spread out to 40 Vaults. When the User requests that file, they call on 40 Vaults. But only the fastest of each (4 Vaults per 1 MB chunk) are used to complete the retrieval. The speed at which the User can retrieve their completed file is limited by the fastest copy of the slowest 1 MB chunk arriving at their location.Instead of a whole 10 MB file being called from only 4 Vaults... you call 40 (1 MB) chunks from 40 Vaults. This makes a BIG difference in retrieval speed.Also, the feature called Opportunistic Caching automatically creates more copies of popular data closer to where it is being requested, so popular websites and other data feeds will actually speed up as they get more visitors, rather than slow down and crash as they do on today’s web.\n\nInformation source:\n\nhttps://safenetwork.wiki/en/FAQ#How_is_data_stored_and_retrieved.3F.C2.A0\n\nhttps://safenetwork.wiki/en/FAQ\n",
			"post_id": 123,
			"date_added": 1515844661
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}