{
	"next_comment_id": 2,
	"comment": [
		{
			"comment_id": 1,
			"body": "About zeronet's future\nI think zeronet needs to develop a profitable model, such as allowing people to engage in content distribution, the establishment of public nodes, and these things must be able to bring people to profit before it was dry. The amount of profit is proportional to the amount of data distributed, provided that these brokers can not read and write anything. The The anything. The The Anything (important thing three times)\nTo ensure that brokers can not read and write content is easy to achieve, but to achieve some people are willing to pay to the intermediary is a problem, there have been based on the chain of the network disk / distribution project, I think all engage in crooked.\nNow say the key: to solve some people are willing to pay to the middlemen I feel the only solution is to let zeronet have their own digital currency, the currency generated by the amount of data content, like brokers to pay also fully automated. (Such as your blog page more than the number of bytes will produce a certain amount of money A, brokers to distribute your content, according to the proportion of the currency A to the middlemen, this ratio can be contracted) zeronet if the statistics can be the whole The amount of data in the network will play a better role in the distribution of wealth.\nThe money produced here can automatically die, there is no upper and lower limits, such as you delete the content, the money generated by your content will disappear regardless of your money in the hands of those who have your logo, you can query Know that If you produce the currency will often disappear, then there is no reason to accept your currency, but you also need money, so you have to re-establish the credit from the creation of the content sold to others to let others generate money and then give you. The money produced can also be used to buy food, with sanitary napkins, if you say only the market aunt is not accepted, I can only say that as long as you did not engage in crooked, it will one day accept, if you have any Please refer to BTC.\nHere I would like to have solved the question of who is willing to pay, and if there are other easy to solve the small problem, it is not the focus I said.\n\nIf you think the above is useful, please donate (BTC): 15XtSKLEebfwdNUJscMpdXxKJfkkRVUZJb\nIf the author of zeronet see the above, or other people to implement the above content, please pull me as a partner, I tm need money, a lot of money.\n\n\nWarmth The following has nothing to do with the above.\n\nNow it's my turn:\n\nI have a project to be able to pry the entire computer industry projects / products, need funds to achieve, I would like to ICO, is a full stack of technology is very hard software engineers to do partners, pry the entire industry, Like Joe Bangzhu then pry the traditional mobile phone industry.\n\nMy TOX: shion@toxme.io\n\nThe above is google translation Original:\n关于zeronet的未来 \n本人觉得zeronet需要可发展盈利的模式，比如允许让人搞内容分发，建立公共节点 ，而这些东西必须要能给人带来盈利才有人干。盈利的额度跟分发的数据量成正比，前提要保证这些中间商不能读写任何东西。。。任何东西。。。任何东西（重要的事说三遍）\n保证中间商不能读写内容很容易实现，但要实现有人愿意给中间商付费就是个问题了，已经出现的基于区块链的网盘/分发项目，我觉得都搞歪了。\n现在说重点：解决有人愿意给中间商付费我觉的唯一解决的方法就是让zeronet有自己的数字货币，货币由内容的数据量产生，像中间商支付也要全自动化的。（比如你的博客浏览量超过多少字节就会产生一定数量的货币A，中间商给你分发多少内容，按比例把货币A分\n\n给中间商，这个比例可以按合约来）zeronet要是能统计整个网的数据量会对财富的分配起到更好的作用。\n这里产生的货币可以自动消亡，也没有上下限，比如你删掉了内容，由你的内容产生的货币也就消失了无论你的货币在谁手上，货币上有你的标识，可以通过查询得知。如果你产生的货币会经常消失，那也就没人原因接受你的货币了，但你又需要货币，所以你必须重新\n\n建立信用从创造内容卖给别人开始让别人产生货币然后给你。产生的货币同样可以用来买菜，跟卫生巾，如果你说菜市场阿姨是不会接受的，我只能说只要你没搞歪了，它总有一天会接受的，如你有任何想不通的请参考BTC。\n说到这里我想已经解决了谁愿意付钱的问题了，如果还有其他容易解决的小问题，那都不是我说的重点。\n\n如果你觉得以上内容很有用请捐赈（BTC）:15XtSKLEebfwdNUJscMpdXxKJfkkRVUZJb\n如果zeronet作者看到以上内容，或者其他人按以上内容去实施了,请拉我作合伙人，我tm需要钱，很多很多钱。\n\n\n温馨提示以下内容与以上内容无关。\n\n现在轮到我的问题了：\n\n我手里有一个能撬动整个计算机行业的项目/产品，需要资金来实现，我想通过ICO来，现征一名全栈技术很硬的软件工程师做合伙人，一起撬翻整个行业，就像乔帮主当年撬翻了传统手机业一样。\n\n我的TOX:shion@toxme.io",
			"post_id": 110,
			"date_added": 1496976710
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}